cmcc-hlj-saml-project/cmcc-hlj-saml-client/src/main/resources/template/samlp.ArtifactResolv.request.template.xml

<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <samlp:ArtifactResolve
            xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
            xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
            ID="${samlId}"
            Version="2.0"
            IssueInstant="${issueInstant}">
            <saml:Issuer>${samlIssuer}</saml:Issuer>
            <samlp:Artifact>${artifact}</samlp:Artifact>
        </samlp:ArtifactResolve>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
